/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstlast.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hhino <hhino@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/05/28 11:32:26 by tokazaki          #+#    #+#             */
/*   Updated: 2023/08/24 18:43:49 by hhino            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

t_libft_list	*ft_lstlast(t_libft_list *lst)
{
	if (!lst)
		return (NULL);
	while (lst->next != NULL)
		lst = lst->next;
	return (lst);
}
//リスト構造体の最後の構造体のアドレスを返す関数
//17:エラー処理
//19:nextがNULLになるまで移動する
//21:最後の構造体のアドレスを返す
